//
//  CustomKeyboardTests.swift
//  CustomKeyboardTests
//
//  Created by 이경민 on 2022/07/15.
//

import XCTest
@testable import CustomKeyboard

class CustomKeyboardTests: XCTestCase {
    var viewModel: KeyboardViewModel!
    
    override func setUpWithError() throws {
        viewModel = KeyboardViewModel()
    }
    
    override func tearDownWithError() throws {
        viewModel = nil
    }
    
    func test_입력() {
        let expected = "헤일못별빛이이런하나의내일봅니다써라이너새워때이름과잠이런위에있습니다별시와사람들의차이름을너무나아직까닭입니다시와내일아침이밤이있습니다남은너무나이런있습니다흙으로풀이이름을많은사람들의불러나의지나가는위에도봅니다별들을딴은추억과아직별빛이어머님파란봅니다"
        
        let compats: [Compatibility] = [
            .ㅎ, .ㅔ, .ㅇ, .ㅣ, .ㄹ, .ㅁ, .ㅗ, .ㅅ, .ㅂ, .ㅕ, .ㄹ, .ㅂ, .ㅣ, .ㅊ, .ㅇ, .ㅣ, .ㅇ, .ㅣ, .ㄹ, .ㅓ, .ㄴ, .ㅎ, .ㅏ, .ㄴ, .ㅏ, .ㅇ, .ㅢ, .ㄴ, .ㅐ, .ㅇ, .ㅣ, .ㄹ, .ㅂ, .ㅗ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㅆ, .ㅓ, .ㄹ, .ㅏ, .ㅇ, .ㅣ, .ㄴ, .ㅓ, .ㅅ, .ㅐ, .ㅇ, .ㅝ, .ㄸ, .ㅐ, .ㅇ, .ㅣ, .ㄹ, .ㅡ, .ㅁ, .ㄱ, .ㅘ, .ㅈ, .ㅏ, .ㅁ, .ㅇ, .ㅣ, .ㄹ, .ㅓ, .ㄴ, .ㅇ, .ㅟ, .ㅇ, .ㅔ, .ㅇ, .ㅣ, .ㅆ, .ㅅ, .ㅡ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㅂ, .ㅕ, .ㄹ, .ㅅ, .ㅣ, .ㅇ, .ㅘ, .ㅅ, .ㅏ, .ㄹ, .ㅏ, .ㅁ, .ㄷ, .ㅡ, .ㄹ, .ㅇ, .ㅢ, .ㅊ, .ㅏ, .ㅇ, .ㅣ, .ㄹ, .ㅡ, .ㅁ, .ㅇ, .ㅡ, .ㄹ, .ㄴ, .ㅓ, .ㅁ, .ㅜ, .ㄴ, .ㅏ, .ㅇ, .ㅏ, .ㅈ, .ㅣ, .ㄱ, .ㄲ, .ㅏ, .ㄷ, .ㅏ, .ㄹ, .ㄱ, .ㅇ, .ㅣ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㅅ, .ㅣ, .ㅇ, .ㅘ, .ㄴ, .ㅐ, .ㅇ, .ㅣ, .ㄹ, .ㅇ, .ㅏ, .ㅊ, .ㅣ, .ㅁ, .ㅇ, .ㅣ, .ㅂ, .ㅏ, .ㅁ, .ㅇ, .ㅣ, .ㅇ, .ㅣ, .ㅆ, .ㅅ, .ㅡ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㄴ, .ㅏ, .ㅁ, .ㅇ, .ㅡ, .ㄴ, .ㄴ, .ㅓ, .ㅁ, .ㅜ, .ㄴ, .ㅏ, .ㅇ, .ㅣ, .ㄹ, .ㅓ, .ㄴ, .ㅇ, .ㅣ, .ㅆ, .ㅅ, .ㅡ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㅎ, .ㅡ, .ㄹ, .ㄱ, .ㅇ, .ㅡ, .ㄹ, .ㅗ, .ㅍ, .ㅜ, .ㄹ, .ㅇ, .ㅣ, .ㅇ, .ㅣ, .ㄹ, .ㅡ, .ㅁ, .ㅇ, .ㅡ, .ㄹ, .ㅁ, .ㅏ, .ㄴ, .ㅎ, .ㅇ, .ㅡ, .ㄴ, .ㅅ, .ㅏ, .ㄹ, .ㅏ, .ㅁ, .ㄷ, .ㅡ, .ㄹ, .ㅇ, .ㅢ, .ㅂ, .ㅜ, .ㄹ, .ㄹ, .ㅓ, .ㄴ, .ㅏ, .ㅇ, .ㅢ, .ㅈ, .ㅣ, .ㄴ, .ㅏ, .ㄱ, .ㅏ, .ㄴ, .ㅡ, .ㄴ, .ㅇ, .ㅟ, .ㅇ, .ㅔ, .ㄷ, .ㅗ, .ㅂ, .ㅗ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ, .ㅂ, .ㅕ, .ㄹ, .ㄷ, .ㅡ, .ㄹ, .ㅇ, .ㅡ, .ㄹ, .ㄸ, .ㅏ, .ㄴ, .ㅇ, .ㅡ, .ㄴ, .ㅊ, .ㅜ, .ㅇ, .ㅓ, .ㄱ, .ㄱ, .ㅘ, .ㅇ, .ㅏ, .ㅈ, .ㅣ, .ㄱ, .ㅂ, .ㅕ, .ㄹ, .ㅂ, .ㅣ, .ㅊ, .ㅇ, .ㅣ, .ㅇ, .ㅓ, .ㅁ, .ㅓ, .ㄴ, .ㅣ, .ㅁ, .ㅍ, .ㅏ, .ㄹ, .ㅏ, .ㄴ, .ㅂ, .ㅗ, .ㅂ, .ㄴ, .ㅣ, .ㄷ, .ㅏ,

        ]
        
        compats.forEach {
            viewModel.didTapKeyboardButton(buffer: $0)
        }
        
        XCTAssertEqual(expected, viewModel.result.value)
    }
    
}
